// Задача №57
// Составить частотный словарь элементов двумерного массива. 
// Частотный словарь содержит информацию о том, сколько раз встречается элемент входных данных.




void Print1DArray (double[] meanArr)
{
    for (int i = 0; i < meanArr.Length; i++)
    {
        Console.Write(meanArr[i] + "\t");
    }
}